Shadofisher/STM32F446_NUCLEO_LVGL/STM32F446/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define TIM2_PWM_CH1_Pin GPIO_PIN_0
#define TIM2_PWM_CH1_GPIO_Port GPIOA
#define TIM2_PWM_CH2_Pin GPIO_PIN_1
#define TIM2_PWM_CH2_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define TP_BUSY_Pin_Pin GPIO_PIN_10
#define TP_BUSY_Pin_GPIO_Port GPIOB
#define LCD_BL_Pin_Pin GPIO_PIN_7
#define LCD_BL_Pin_GPIO_Port GPIOC
#define MOTOR1_DIS_Pin GPIO_PIN_8
#define MOTOR1_DIS_GPIO_Port GPIOC
#define LCD_DC_Pin_Pin GPIO_PIN_8
#define LCD_DC_Pin_GPIO_Port GPIOA
#define LCD_RST_Pin_Pin GPIO_PIN_9
#define LCD_RST_Pin_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define TP_IRQ_Pin_Pin GPIO_PIN_3
#define TP_IRQ_Pin_GPIO_Port GPIOB
#define TP_CS_Pin_Pin GPIO_PIN_5
#define TP_CS_Pin_GPIO_Port GPIOB
#define LCD_CS_Pin_Pin GPIO_PIN_6
#define LCD_CS_Pin_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
